# Creating dataframe from python dictionary

In [62]:
import pandas as pd

In [63]:
empdata = {
    'empid' : [1001,1002,1003,1004,1005],
    'ename' : ['madan','pandey','soma','gagan','suresh'],
    'salary' : [36000,45000,27000-50,56000,43000],
    'doj' : ['01-01-2016','03-04-2016','12-06-2016','02-01-2017','02-07-2017']
}
# Convert this dictionary into Data Frame class object
df = pd.DataFrame(empdata)
df

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016
2   1003    soma   26950  12-06-2016
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

## Creating Data Frame for python list of tuples

In [64]:
empdata = [(1001,'madan',36000,'01-01-2016'),
          (1002,'pandey',45000,'03-04-2016')
          ]
df2 = pd.DataFrame(empdata,columns=['empid','ename','salary','doj'])
df2

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016

### Data Extraction : Viewing Data frame using loc() and iloc()

In [65]:
# To view all rows with only 'ename' and 'doj' column
df1 = df.loc[:,['ename','doj']]
df1

    ename         doj
0   madan  01-01-2016
1  pandey  03-04-2016
2    soma  12-06-2016
3   gagan  02-01-2017
4  suresh  02-07-2017

In [66]:
df1 = df.loc[:,['empid','ename','salary','doj']]
df1

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016
2   1003    soma   26950  12-06-2016
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

In [67]:
df1 = df.iloc[:,[0,2]]
df1

   empid  salary
0   1001   36000
1   1002   45000
2   1003   26950
3   1004   56000
4   1005   43000

In [68]:
# To view only 0 to 3rd rows of 'ename' and 'doj' column
df1 = df.loc[0:3,['ename','doj']]
df1

    ename         doj
0   madan  01-01-2016
1  pandey  03-04-2016
2    soma  12-06-2016
3   gagan  02-01-2017

In [69]:
df1 = df.iloc[0:3,[1,3]]
df1

    ename         doj
0   madan  01-01-2016
1  pandey  03-04-2016
2    soma  12-06-2016

In [70]:
df1 = df.loc[0:3,:]
df1

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016
2   1003    soma   26950  12-06-2016
3   1004   gagan   56000  02-01-2017

In [71]:
# To view 3rd row to 0th row with all columns
df1 = df.loc[3:0:-1,:]
df1

   empid   ename  salary         doj
3   1004   gagan   56000  02-01-2017
2   1003    soma   26950  12-06-2016
1   1002  pandey   45000  03-04-2016
0   1001   madan   36000  01-01-2016

In [72]:
# To retrieve only last row
df1 = df.iloc[-1]
df1

empid           1005
ename         suresh
salary         43000
doj       02-07-2017
Name: 4, dtype: object

## Operations on Data Frames

In [73]:
# Knowing no. of rows and columns
df.shape

(5, 4)

In [74]:
# To retrieve only rows or columns from the tuple
r,c=df.shape
print(r)

5

### Retrieve rows and data frame

In [75]:
df.head(5)

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016
2   1003    soma   26950  12-06-2016
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

In [76]:
df.head(3)

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016
2   1003    soma   26950  12-06-2016

In [77]:
# tail() will retrieve last 5 rows
df.tail(5)

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016
2   1003    soma   26950  12-06-2016
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

In [78]:
df.tail(2)

   empid   ename  salary         doj
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

# Retrieving a Range of Rows

In [79]:
# To display 2nd row to 4th row
df[2:5]

   empid   ename  salary         doj
2   1003    soma   26950  12-06-2016
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

In [80]:
# To display alternative rows
df[0::2]

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
2   1003    soma   26950  12-06-2016
4   1005  suresh   43000  02-07-2017

In [81]:
# To display in reverse order
df[4:0:-1]

   empid   ename  salary         doj
4   1005  suresh   43000  02-07-2017
3   1004   gagan   56000  02-01-2017
2   1003    soma   26950  12-06-2016
1   1002  pandey   45000  03-04-2016

### To retrieve column names

In [82]:
df.columns

Index(['empid', 'ename', 'salary', 'doj'], dtype='object')

In [83]:
### To retrieve column data
df.empid

0    1001
1    1002
2    1003
3    1004
4    1005
Name: empid, dtype: int64

In [84]:
df['empid']

0    1001
1    1002
2    1003
3    1004
4    1005
Name: empid, dtype: int64

In [85]:
# Retrieving data from multiple columns
df[['empid','ename']]

   empid   ename
0   1001   madan
1   1002  pandey
2   1003    soma
3   1004   gagan
4   1005  suresh

In [86]:
# Finding min and max values
df['salary'].max()

56000

In [87]:
df['salary'].min()

26950

In [88]:
### Displaying statistical information
df.describe()

             empid        salary
count     5.000000      5.000000
mean   1003.000000  41390.000000
std       1.581139  10800.949032
min    1001.000000  26950.000000
25%    1002.000000  36000.000000
50%    1003.000000  43000.000000
75%    1004.000000  45000.000000
max    1005.000000  56000.000000

### Performing queries on data

In [89]:
# To retrieve emp whose sal is >40000
df[df.salary>40000]

   empid   ename  salary         doj
1   1002  pandey   45000  03-04-2016
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

In [90]:
# To retrieve the row where salary is maximum
df[df.salary==df.salary.max()]

   empid  ename  salary         doj
3   1004  gagan   56000  02-01-2017

In [91]:
# To display multiple cols 
# df[[column names]] [query]
df[['empid','ename']][df.salary>40000]

   empid   ename
1   1002  pandey
3   1004   gagan
4   1005  suresh

In [92]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [93]:
# To make 'empid' col as index for df
df1 = df.set_index('empid')
df1

        ename  salary         doj
empid
1001    madan   36000  01-01-2016
1002   pandey   45000  03-04-2016
1003     soma   26950  12-06-2016
1004    gagan   56000  02-01-2017
1005   suresh   43000  02-07-2017

In [94]:
df

   empid   ename  salary         doj
0   1001   madan   36000  01-01-2016
1   1002  pandey   45000  03-04-2016
2   1003    soma   26950  12-06-2016
3   1004   gagan   56000  02-01-2017
4   1005  suresh   43000  02-07-2017

In [95]:
# Resetting the indexing
df.reset_index(inplace=True)
df

   index  empid   ename  salary         doj
0      0   1001   madan   36000  01-01-2016
1      1   1002  pandey   45000  03-04-2016
2      2   1003    soma   26950  12-06-2016
3      3   1004   gagan   56000  02-01-2017
4      4   1005  suresh   43000  02-07-2017